[
    {
        "Year": 2023,
        "Author": "Lexi Pelle",
        "Title": "DIET COKE",
        "Poem": "All I saw my mother drink \nfor years. In the diner, served \nwith a striped straw and shredded\npaper beanie or sometimes \nat Stop & Shop just before checkout, \nits perfect plastic body pulled from \nthe squat fridge that sits underneath \nthe conveyor belt—but most often \nsipped from a silver can on the porch. \nShe never asked for ice. Never dared \nto dilute the fizzy pollution of artificial \nsweeteners. The first time I tried it \nI thought it tasted like a backhanded \ncompliment, surprisingly good, \nthe dark dizzying lake like a cactus \nburped Splenda into my mouth. \nThe flavor so far from milk or juice, \nlike a fresh-squeezed robot, a supermodel’s \nsaliva. My sister and I sat around her \nlike the students of Socrates and watched her \nsuccumb to the only sweetness she ever allowed\nherself. A true mother, listening \nto the questions it spat into the air,\nvoice lifted at the end of every swallowed\nsentence. Let’s play the quiet game? \nshe suggested on long car trips\nto Hershey or to one of Kate’s soccer \ntournaments and only then could we all hear it\nwhisper to her from the cup holder\nas a speed bump puddled the lid\nand she brought the spill to her lips. "
    },
    {
        "Year": 2022,
        "Author": "Nianxi Chen",
        "Title": "JUNE IS ALMOST DONE",
        "Poem": "June is almost done. In all of June,\nI didn’t finish a single thing.\nFather is in bed,\nsmaller and smaller, day by day.\nThe time left to him by the world\nisn’t much.\nAnd how much is left to me?\nI visit him three times per day,\nnothing more than ten steps looking at five.\nThe south-facing window is always open.\nFather crafted the wood lattice when he was a young man.\nLast night, he awoke from a coma,\nsuddenly told Mother: When I’m gone,\nbury me with my carpenter ax.\nJune is almost done. Cornstalks in the field\nare as tall as a man.\nThe empty mountain is filled with cicada sounds.\nOnly newcomers comfort the leave-takers.\nOnly time receives the world’s enlightenment."
    },
    {
        "Year": 2021,
        "Author": "Danusha Laméris",
        "Title": "APPOINTMENT",
        "Poem": "I’m leaned back on the table, the nurse strapping \na band around my bicep, when she says,\nSo, your son must be thirteen by now. No, I say \nhe’s dead, which isn’t how I mean to say it.\nOh! she says, your chart. Yes, I say. His birth,\nthe year. And now she feels bad. I’m sorry, she says,\nI’m so sorry. It’s OK, I tell her, but the reading is too high,\nthe pressure. We’ll try and do it again, she says.\nAgain. Again. The times I step back into the story,\nand in this story my son is still living inside\nme, he’s aquatic. I am the fish bowl and he is\nthe fish. I imagine his bones, his lungs, the small\nperfect heart. And also, his hands, his feet. \nA body growing inside another body. So precise.\nAnd then he’s on the outside and it doesn’t work:\nThe air. Gravity. I want to apologize. He can’t breathe\nright, he keeps convulsing, the electric\nsurge ticking his head to the left, the left, his\nlip curled in disgust, but no, he looks more afraid—\nsome terror coming towards him. Not blue, not blue, \nI tell myself the times it happens and he isn’t. \nThe doctor says, the bad kind of blue is cobalt, smurf blue. \nDusky is not the worst kind. But how does she know \non a baby this shade of brown? Does she? \nI’m sorry, I’m so sorry, I tell him in the hospital again \nbut he can’t hear me because the sedative and the new doctor\nis asking me can a student insert a long needle \ninto his spinal column, would that be OK?\nI look out the window and there’s plants, a garden.\nOur nurse comes in, says, There’s another garden\non the roof. You can go look. Just don’t jump off.\nThe story is a circle that repeats, a round,\nthe voices overlapping. He’s in my arms again\nmy baby, my baby, I am singing to him.\nI kiss his cheek, his hair. And now he’s not thirteen. \nHe’s not anything. The nurse has left and I’m alone.\nOn the ceiling is a lake, a field of flowers.\nLet’s try this again, I say to no one. Can you see me?\nI’m still here. I’m lying on the table, looking up."
    },
    {
        "Year": 2021,
        "Author": "Jinendra Jain",
        "Title": "THOSE DAYS",
        "Poem": "You can take all the rusting gold I secreted away,\nfor those monsoons until childhood slipped away;\nthose petrichor smells, flooded lanes,\nand paper-boats that floated away;\nthose long power-cuts, roof-top cots,\nand sultry summer nights chatted away;\nthose last-row wooden-benches we fought for,\nand the whispers when teachers looked away;\nthose childhood vows of togetherness, JJ,\nand the smiling faces that have faded away."
    },
    {
        "Year": 2022,
        "Author": "Ting Li",
        "Title": "A LITTLE FLOWER",
        "Poem": "A little flower doesn’t know how beautiful she is \nShe has no such a concept\nA little flower doesn’t even know her own name\nNot to mention the meaning\nOn the side of the road\nA little flower never feels lonely\nShe blooms as if she doesn’t know she will wither\nShe withers as if she doesn’t know what is wither\nShe just quietly blooms, blooms\nLike a ring that is just the right size\nWorn on the knuckle of God"
    },
    {
        "Year": 2023,
        "Author": "Karan Kapoor",
        "Title": "PORTRAIT OF THE FATHER AS AN ALCOHOLIC",
        "Poem": "The first thing I notice about him\nis the expression on his face baring\nhis sobriety is a bubble one can pop\nwith a blow. He is a unicorn—a horse\nof addiction with a horn of dedication\nto quit. The days he chooses not to drink\nflake off his shoulders like cracked paint.\nBy the time he was my age, he’d burned\nalcohol into his skin. He’s not guilty\nof all he’s accused, but still guilty\nof so much else. Why should I draw\nhis portrait in third-person when I\ncan in second- which is to say why\nshould I paint you in blue when I can\nin sky? For decades, you have smelled\nlike areca nut and slaked lime.\nWe have amassed wrinkles begging\nyou give up. Ma doubts you\nwill die a delighted man. As do I.\nAs do you. Diamond wounds\ndiamond, you say. Why does water\nnot wash away water? Poison remedies\npoison, why does wind not blow away\nwind? The despair of not raising a glass\nto despair is an essential precondition\nof despair which echoes higher\nthan cheer that comes by confessing\ncheers. Long after you, we will boast\nbruises on our chest to show you\nwere here. Now we bathe\nstone in milk, bury a sitar\nin a tree for the wind to strum,\npraying the music will urge you\nto seek help. You’re God,\nyou sing."
    },
    {
        "Year": 2023,
        "Author": "Pella Winkopp",
        "Title": "UNDERWATER LAKES",
        "Poem": "there is a stillness in me that refuses to be translated,\noceans within oceans; my halcyon halocline unmoving,\nstiffened by my own salty breath.\ndo you hear it now?\nthe symphony of tiny footsteps beneath my chest,\nthe swallowing of rivers,\ndamp droughts swirling into cyclones;\na paradox of movement.\ni am nothing but everything i failed to become,\na quiet idealization of my worst dreams;\nthe bread knives in my mind chafing\nagainst the hard meat of ambition; destroying entirely\nanything yet too soft to call itself purpose.\nthese are the brine pools of the wilted,\nus unlucky, lethargic few burning warmer than the sun\nwithout a cloth with which to catch.\ni have nothing but the names they gave me,\ndull now and hidden beneath the skin of my palms,\npickling in the slow sink of inertia."
    },
    {
        "Year": 2021,
        "Author": "Srinivas Mandavilli",
        "Title": "RAIN",
        "Poem": "We lay together on a charpoy, the thrum on asbestos roofs ending all days. The downpour cantillates like Sanskrit chanting we had heard at Kamakhya temple, the one in the drenched valley of leechee and guava trees. As we gathered by Dikhow’s shore, the river gravid with mud, branches and massive trunks flowed with a ferocity towards a cantilever bridge. Brahmaputra becomes a sea every monsoon, never settling, inundating all the elephant grass which our mahout carefully holds back on our rides. Today we wander into another summer on Lakshman Jhula where the Ganges turns green, tourists run to small motels to escape the drizzle. Some things do not change—the small delight of sitting on a railway platform savoring chana dal fritters by wet train tracks with steaming cardamom tea in clay cups. There is a storm expected, already the smell of rain mouses its way in like the time you cried after your mother’s passing, the sky was splayed by Indra’s bow. There was so much dampness the night your water broke, as we ran from the laundromat with a newspaper over our heads, the car’s floor mats also soaked from a leaking heater core. And this is how I know you, on an outrigger listening to a whale song in a drizzle, breeze coursing on your face, not joyless but not joyous for anything and in its swells  \nflood waters pour in a thought that the world might change \nonce or not at all"
    },
    {
        "Year": 2022,
        "Author": "Max Sessner",
        "Title": "ONE DAY",
        "Poem": "Everything comes back to haunt us\none day the boy you beat\nup a long time ago\nstands before you in the street car\nhe is like you now around\nsixty his hair thin like\nyours generally he looks \nlike you moves like \nyou as he approaches you\nwalks past gets off\nat the next stop\nthat was it you turn\nafter him and note \nthe stop and tomorrow\nyou will forget it"
    },
    {
        "Year": 2023,
        "Author": "M",
        "Title": "SALT",
        "Poem": "In this room down a hall\nat the Hopewell House\nevery Wednesday\nfrom 6:30 to 8:00 p.m.,\nthe widowed have agreed to meet\nto lick the salt block.\nMy name tag reads\nAlbino deer (recessive rarity): widow at 35.\nDun-colored Helen and Marie\nmistake me for a sheep or a goat\nas we draw our chairs into a circle\nof circumstance. Muscles in their aged faces\ntwitch with greed and suspicion.\nIn the larger world,\nJean and I would sit in adjoining streetcar seats,\nread our newspapers,\nand never share a headline.\nEven Doris, who drags the remains\nof a personal god at the bottom\nof her purse, tucked next to non-prescription\nreading glasses she bought on sale at Walmart,\nshrinks from my pink eyes.\nLouise has ten grandchildren,\nthree she and Harry were raising\nbecause her daughter is, well, you know,\nshe doesn’t want to say. She won’t tell you either\nthat when Harry up and died like that,\nsome small part of her wished\nhe’d had the decency to take those kids with him,\nbut he never even took them to the park.\nBetty lost a husband and found\na lump. Elsie says when the ambulance\ncomes to the Ridgewood Nursing Home,\nthey don’t turn on the sirens\nfor fear they’ll incite a riot\nof dying. Ida says yeah, she knows.\nShe’s lost two of them that way. I nod.\nJudith’s raised eyebrow asks\nWhat could one with hooves so pale know of loss?\nA marriage must be long\nto be 40 years deep,\nand grief is a black market business\nbest kept to themselves. If I taste it,\nothers will want it.\nYoung bucks will be dying in droves.\nIn war, in the streets,\nin flaming buildings.\nOr quietly in a bed next to me at night.\nThat sting in the wound, that particular tang\non the tongue, are theirs.\nKeep me away from the salt.\nTheir old ones are sanctified,\ntheir sorrow is sacred,\ndenial alive in the hide."
    }
]