[
    {
        "Year": 2023,
        "Author": "Christopher Hunter",
        "Title": "LOUISA, AGE 6, AT REST",
        "Poem": "Louisa alighting into placeAlways dazzles me.\nShe twists with surpassing graceInto an inverted curtsey.Her arms smoothly interlace,As she gets all topsy-turvy.Until, in sudden about-face,\nShe folds her knees,And flees."
    },
    {
        "Year": 2023,
        "Author": "Susan J Koch",
        "Title": "SOFIA",
        "Poem": "I cannot disrememberthree carefree boysdragging a bear cubthrough Macedonia Square -a ring through itsbloodiednose."
    },
    {
        "Year": 2023,
        "Author": "John Mitchell",
        "Title": "NICHOLAS II",
        "Poem": "The ghost of the Tsar walks.He passes some Jews and Gypsies.One curses him; another throws a rock.Bad angels fold their wings and watch.\nChoirs sang at his birth,Armies moved at his command.God rang the bellsWhen he walked into cathedrals.But now he hears the noise from out the eastAnd sees the fire in the western sky.\nDeath crowned him at his birth,His cousins glittered throughout Europe.He seldom followed good adviceAnd did not ask permission.He lost a navy in a foreign seaAnd an army gone at Tannenberg,But still he played the emperor.Magnificence is blind and deaf,And death took all his dynasty."
    },
    {
        "Year": 2023,
        "Author": "Alise Palmer",
        "Title": "BELTANE",
        "Poem": "A boy green shouldered, growslike corn endlessly and over night.There is no laying on of handsand praying him small again. Hewill not be touched like that.\nHis eyes are the color of home -almond and curious with episodesof Breughel. He wants life indetail and spillingfrom his pockets.\nHis laughter cannot beattached to anything. It leaveslike silver paper geesein shimmering specksand fills the airsurrounding for acresat the speed of memory."
    },
    {
        "Year": 2023,
        "Author": "Rose Postma",
        "Title": "ON TELLING MY MOTHER I AM PREGNANT AGAIN",
        "Poem": "My mother, who spent the day after my birth trying to decidehow to tell my father she didn't want another child\nbut went on to have eight more, says: the doctors will tell youthe pain of giving birth is erased by hormones and endorphins\nscrubbed from the slick surface of every sensory pathwayand the anterior cingulate cortex, wiped clean like\na school bus window on a thick tule fog morningby the back of your hand, but the pain is still there\nlike the letters you traced with the tip of your cold fingerin the steam on the glass, waiting for your hot breath\nto reveal them again and again, waiting to spell outwhat agony means. The pain: it's latent like an undertow\nbeneath the ice on a Canadian lake, like a knotheld down by the lacquer of an oak tabletop."
    },
    {
        "Year": 2022,
        "Author": "Phoebe Bubendorfer",
        "Title": "OIL SPILL",
        "Poem": "A red-throated loonmired in a slick of oilstrains her neckin each effortto lift her bodyfrom the toxic sludge.\nOne last quiverof wings.She lowers her headto her breasteyes closed inacceptance.Rainbows in her feathers."
    },
    {
        "Year": 2022,
        "Author": "Bill Graeser",
        "Title": "THE BURNING OF THE WHALES",
        "Poem": "Fire never seems to mindwhether it's the curl of a candle wickor a bed with baby sleeping.\nSo it was with the whalesbeached in Oregonand the not knowingwhat else to dowith the corpses.\nIf we were but firewe would not mind either.\nBut we are also water,even one drop of whichforms a tear.\nThose who were there that day,who lit the matchand beheld the flameson fiery wings rise,\nthey will never forgetthe trembling of the seain their chest."
    },
    {
        "Year": 2022,
        "Author": "John Mitchell",
        "Title": "THE BUFFALO",
        "Poem": "The buffalo stands still in the wind.Staring ahead, huge, not even botheringTo guard its flanks.Mysterious, majestic, silent.Misplaced in this warm world,Waiting for the next interval of ice,Watching the horizon for the returnOf glaciers and the arctic birds,Screaming from the cold, blue sky."
    },
    {
        "Year": 2022,
        "Author": "Lily Nelson",
        "Title": "FEVER",
        "Poem": "You are nineLying on the front room couchAnd time is thick like jellyFever has made the world softAnd goldenHoney coating your skinStuck in your earsHeavy enough that moving feels like wading through a poolExcept worseExcept slower and more tiringLike the world is a blanket wrapped around your shouldersAnd now the world is burningYou can't smell the smokeBut your skin feels like you've become a starA bright heat coursing through your veinsFlesh pasty and paleThe world is too bright and hot for nothing to be burning"
    },
    {
        "Year": 2022,
        "Author": "Lucille Morgan Wilson",
        "Title": "LISTENING TO DVORAK'S HUMORESQUE",
        "Poem": "The fingered notes play up and down my spinelike gentle ripples in a laughing stream.Caresses linger, freeing by designsweet fantasies I had not dared to dream.\nA swell of melody weaves shining chordsinto my reverie, pulls me alongwith silver strings. Such leading, peace affords.Staccato notes, both delicate and strong,\nstrew in my path bright nuggets of delight:a momentary rainbow after shower;stars bursting through the canopy of night;the dance of carillon bells from a tower.\nThe final quarter notes fall clear and sweetand drop a host of bluebells at my feet."
    },
    {
        "Year": 2021,
        "Author": "Allison Berryhill",
        "Title": "SONNET TO MY STUDENTS ON THE FIRST DAY OF CLASS",
        "Poem": "Come in and make a mess with all your thoughts.Here shake them loose and spill them on the page.Then push them, pull them, tie them into knots.Your words are laughter, questions, hopes, and rage.The writing in this room will echo, poundagainst our heads and hearts: cacophony.Then, crash of who we are creates a soundFrom which our hearts rise up: a symphony.For mess and noise and joyful chaos reignIn space where all experiment and try.To set you free, I loose you from the chains,Release you to explore your inner eye.So, welcome. I invite you to a yearOf messy, joyful learning without fear."
    },
    {
        "Year": 2021,
        "Author": "Heather Ann Clark",
        "Title": "TURTLE SHELLS",
        "Poem": "My therapist asks what else is on my mind.A pithy incident, too long ago to recountwithout exposing more than I wish today.Instead, I tell her it's turtles.Turtle shells, actually.And how a wildlife refugeput out a call to womenasking for the hook and loop piecesfrom discarded bras. How thesegarbage items are being attachedto broken turtle shells. The victimsof menacing cars barreling down the road,but saved by the strength of their shellsand a kindly person to take them to shelter,where wire and patience guidethe broken shell back together,until it fuses shut again on its own."
    },
    {
        "Year": 2021,
        "Author": "Jared Pearce",
        "Title": "ILLNESS",
        "Poem": "It's like waiting for the elevatordoors to release me, letting thisvirus run its course. Nothingwill rub it out or bribe it, justthe clicking of days; like sitting\nthrough meetings or findingthe next politician, so manyminutes have to expire, thenlife can resume its functiontoward beauty, rather then\nwaiting for the clothes to dryor the shower to open or foodto cook or cool or be availableor the child to walk to stop walkingor the girl to love and keep loving."
    },
    {
        "Year": 2021,
        "Author": "Shelly Reed Thieman",
        "Title": "ON THE ANNIVERSARY OF ANOTHER WINTER",
        "Poem": "Tongue-tied with suet and peanutbutter, a quartet of nuthatches nimbleas eighth notes commune at the feeder.\nOwl calls my secret name as duskraps his chapped knuckleson the kitchen window.\nDog and I allow him in unshaven,his face creased deeplyas an ancient blueprint.\nA mirage of deer disappearstoward the pond while snow brusheslayers of white over lashes\nof the pine bough. Tranquilitylands, light as a moth. I inviteit in for a snifter of brandy\nand like the moon, learnto harmonize with darkness."
    },
    {
        "Year": 2021,
        "Author": "Erik Trilk",
        "Title": "DAZED AND CONFUSED",
        "Poem": "It won't be long until I'm with the moonthis summer. Bare feet whisper on midnightgrass. Drenched dazed and confused afternoons soon.Flags furled high on the fourth. Ball caps slightly\nOff-balance. Out of order. Life shut down.Pebbles sprinkle high school bedrooms at night.\"I'll be right down,\" she smiles, fearful of sound.Hands entwined; fingers sweat. Teenage forthright.\nMidnight memories turn into dawningsuns. Iowa yawns her dawn's early sign.Small towns reveal their majestic awnings.Morning tiptoes through tall beams of sunshine.\nA girl kisses a boy. Lips stay disposed,smiling... until eyes are no longer closed."
    }
]